public class MMMMain {
}

/*
Как вариант пузырьковый метод. 
меняем слева на право
получаем сортироовку по группе
потом в группах сортировку по оценке
потом по оценкам сортировку по имени

засипочный вопрос это про устойчивость (в некоторой летературе стабильная, но у меня в коспектах устойчивая)
условно одинаковые элименты остовались на своих места при сортировке 
вроде как в этом примере можно использовать не устойчивый алгоритм, ибо вссе ключи используются, но я думаю что ошибаюсь

пузырьковый метод устойчив
быстрая сортировка нет
*/

//INTERIA та что от JetBrains